[MagicSchool.A_honneur_du_mage_Buff H7BaseBuff]
mName="衰竭"
mTooltip="生物的攻击降低 %stat1.norm %icon_attack。"

[CreatureGrowthBonus.A_Requin_growth_Buff H7BaseBuff]
mName="鲨之军势"
mTooltip=""

[CreatureGrowthBonus.A_sirene_growth H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="人鱼军势"
mTooltip="总督技能：该城控制区域内水泽仙女和雪女的周产量增加 %buff1.buff.stat。"

[CreatureGrowthBonus.A_Kappa_growth_Buff H7BaseBuff]
mName="河童军势"
mTooltip=""



[MagicSchool.A_bulle_de_soins_Buff H7BaseBuff]
mName="治疗水泡"
mTooltip="英雄在战斗回合结束时，治疗处于水泡效果下的友方生物 %d1 %icon_health 点生命值。持续 %durnow 回合。"

[MagicSchool.A_honneur_du_mage H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="法师荣耀"
mTooltip="每当友方生物近战攻击一个未反击的敌人时，该英雄有30%几率获得 %buff1.buff.stat1 %icon_magic 魔力，持续到战斗结束。"

[CreatureGrowthBonus.A_Kappa_growth H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="河童制作"
mTooltip="总督技能：该城控制区域内河童和河童庄屋的周产量增加 %buff1.buff.stat。"

[CreatureGrowthBonus.A_requin_growth H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="鲨之武士制作"
mTooltip="总督技能：该城控制区域内鲨鱼战士和鳄鲨侍的周产量增加 %buff1.buff.stat。"

[CreatureGrowthBonus.A_sirene_growth_Buff H7BaseBuff]
mName="河童制造"
mTooltip=""

[MagicSchool.A_bulle_de_soins H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="治疗水泡"
mTooltip="该英雄在战斗回合结束时，治疗处于水泡效果下的友方生物 %buff1.buff.d1 %icon_health 点生命值。持续战斗的前 %buff.buff.durini 回合。"

[MagicSchool.A_Water_heal_Buff H7BaseBuff]
mName=""
mTooltip=""

[MagicSchool.A_Water_heal_hero_Buff H7BaseBuff]
mName="招募官（城镇增益）"
mTooltip=""

[Mightshcool.A_anguille_master H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="鳗鱼之父"
mTooltip="该英雄使“Unagi”和“Denki Unagi”生物的生命值 %icon_health 提高 %buff1.buff.stat1。"

[Mightshcool.A_Anguille_master_Buff H7BaseBuff]
mName="进攻术"
mTooltip="生物的伤害提高 %stat1。"

[Mightshcool.A_honneur_du_combatant H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="战士荣耀"
mTooltip="每当友方生物近战攻击一个未反击的敌人时，该英雄有30%几率获得 %buff1.buff.stat1 %icon_attack 攻击，并有30%几率获得 %buff1.buff.stat1 %icon_defense 防御，持续到战斗结束。"

[Mightshcool.A_honneur_du_combatant_Buff H7BaseBuff]
mName="衰竭"
mTooltip="生物的攻击降低 %stat1.norm %icon_attack。"

[Mightshcool.A_Regard_petrifiant H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="石化凝视"
mTooltip="该英雄在使用基础攻击或法术造成伤害时，有30%几率麻痹目标敌人。"


[Sanctuary_ability_sup.A_KappaLord H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="大河童"
mTooltip="英雄军队中的河童和河童庄屋获得 %spell1.name 和 %spell2.name 技能。"

[Sanctuary_ability_sup.A_SharkLord H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="鲨鱼帕库利达"
mTooltip="英雄军队中的鲨鱼战士和鳄鲨侍获得 %spell1.name（每当该生物受到敌方生物的远程攻击伤害时，它会获得伤害、移动力加成，并且免疫负面精神效果，直到其下一回合结束）和 %spell2.name 技能。"

[Sanctuary_ability_vitalite.A_Kirin_trainer H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="麒麟教练"
mTooltip="英雄军队中的麒麟和神圣麒麟拥有 %buff.buff.stat1 %buff.buff.stat1.icon 防御、%buff.buff.stat2 %buff.buff.stat2.icon 生命值，并获得 %spell3.name 技能。"

[Sanctuary_ability_vitalite.A_Naga_Dresseur_Buff H7BaseBuff]
mName="主人娜迦"
mTooltip="%stat1 %icon_health 加成，此生物总是进行最大射程攻击。"

[Sanctuary_ability_vitalite.A_Nagga_dresseur H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="蜕皮"
mTooltip="该英雄使浴巾娜迦和渔师娜迦的生命值提高 %buff1.buff.stat1 %icon_health，并且此生物总是进行最大射程攻击。"

[Sanctuary_ability_vitalite.A_T6_trainer H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="浪人教练"
mTooltip="英雄军队中的浪人和大名拥有 %buff.buff.stat1 %buff.buff.stat1.icon 防御、%buff.buff.stat2 %buff.buff.stat2.icon 生命值，并获得 %spell3.name 技能（该生物受到的伤害减少50%，并在受到伤害时获得“顺劈”技能（该生物总是攻击两次。被攻击的生物在第一次攻击后有机会反击）。持续3回合。每场战斗激活一次）。"

____________________________

1.28 : 

[Valkiri_new_ability.A_FireShield H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="火焰护盾"
mTooltip="敌方生物近战攻击或反击该生物时，承受所造成伤害的 %d1 作为火焰伤害。"


[name_chest.A_big_chest_Name H7GlobalName]
mName="梦境宝箱"

[name_chest.A_camp_fire_global_name H7GlobalName]
mName="营火"

[name_chest.Name_RunicBox H7GlobalName]
mName="黄金宝箱"

[name_chest.Name_new_artefact H7GlobalName]
mName="高级宝物"


__________________________________


version 1.35 :

[haven_specialisation.A_griffinTamer_serguei H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="狮鹫驯养师"
mTooltip="英雄军队中的狮鹫和帝国狮鹫拥有 %buff.buff.stat1 %buff.buff.stat1.icon 防御、%buff.buff.stat2 %buff.buff.stat2.icon 生命值，并获得 %spell3.name 技能。（如果初始位置仍然可达，该生物在攻击后会飞回其初始位置）。"

[MagicSchool.A_Water_heal_ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="寻觅者"
mTooltip="总督技能：只要该英雄是总督，所有友方英雄在战斗开始时获得 %buff1.buff.buff.buff.stat %icon_Magic 魔力，并且法术书中的 %spell3.name 法术被启用。"

[Sanctuary_ability_sup.A_gardienLord H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="抵抗"
mTooltip="英雄军队中的海洋卫士和深渊卫士获得 %spell1.name（该生物和相邻的友方生物在回合开始时获得防御加成并移除一个随机的负面魔法效果）和 %spell2.name 技能（该生物和所有附近友方生物在该生物回合开始时恢复生命值）。
（对亡灵和构装体无效）。"